In [1]:
import numpy as np
import pandas as pd

In [2]:
sdata = {'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [3]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [47]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
       'year':[2000,2001,2002,2001,2002],
       'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [15]:
#열 추출
frame['state']

state    Ohio
year     2002
pop       3.6
Name: 2, dtype: object

In [ ]:
#행 추출
frame.loc[2]

In [24]:
#~행 ~열 추출
frame.iloc[1:4,1:4]

   year  pop
1  2001  1.7
2  2002  3.6
3  2001  2.4

In [43]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [55]:
frame.rename(columns={'pop':'populaion'})

       st  year  populaion
0    Ohio  2000        1.5
1    Ohio  2001        1.7
2    Ohio  2002        3.6
3  Nevada  2001        2.4
4  Nevada  2002        2.9

In [61]:
frame.drop([2])

       st  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [63]:
frame.drop('year', axis=1)

       st  pop
0    Ohio  1.5
1    Ohio  1.7
2    Ohio  3.6
3  Nevada  2.4
4  Nevada  2.9

In [66]:
d = {'employee':['Bob','Jake','Lisa','Sue'],'group':['Accounting','Engineering','Engineering','HR']}
e = {'group':['Accounting','Accounting','Engineering','Engineering','HR','HR'],'skills':['math','spreadsheets','coding','linux','spreadsheets','organization']}
df1 = pd.DataFrame(d)
df2 = pd.DataFrame(e)

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [67]:
pd.merge(df1,df2)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [79]:
[['0.0','3.0','6.0','9.0'],
 ['1.0','4.0','7.0','10.0'],
 ['2.0','5.0','8.0','11.0']]

[['0.0', '3.0', '6.0', '9.0'],
 ['1.0', '4.0', '7.0', '10.0'],
 ['2.0', '5.0', '8.0', '11.0']]

In [73]:
frame = DataFrame(np.arange(12).reshape((3,4)),)

[[2, 2], [3, 3]]

In [ ]:
df1 = pd.DataFrame(frame1)
frame1 = {index=['Utah','Ohio','Texas','Oregon']
          'b':['0.0','3.0','6.0','9.0'],'d':['1.0','4.0','7.0','10.0'],'e':['2.0','5.0','8.0','11.0']}
df1 = pd.DataFrame(frame1)
frame1